posts/algorithm-weekly-generate-parentheses.org
#+BEGIN_COMMENT
.. title: 每周算法：生成有效的括号组合
.. slug: algorithm-weekly-generate-parentheses
.. date: 2018-09-30 13:31:46 UTC+08:00
.. tags: algorithm, leetcode, dp, bfs
.. category: algorithm
.. link: https://leetcode.com/problems/generate-parentheses/description/
.. description:
.. type: text
#+END_COMMENT

#+TITLE: 每周算法：生成有效的括号组合

leetcode 算法题第22道，难度为medium，对指定数量的括号进行排列组合，列举出其中有效的结果。对括号的处理通常出现在表达式分析中，这道题目是了解括号表达式特性的很好切入点。

{{{TEASER_END}}}

** Description
Given n pairs of parentheses, write a function to generate all combinations of well-formed parentheses.
For example, given /n/ = 3, a solution set is:
#+BEGIN_EXAMPLE
[
  "((()))",
  "(()())",
  "(())()",
  "()(())",
  "()()()"
]
#+END_EXAMPLE

来源：[[https://leetcode.com/problems/generate-parentheses/description/][leetcode 22 generate parentheses]]

** Solution

