posts/algorithm-weekly-generate-parentheses/index.html
<!DOCTYPE html>
<html prefix="og: http://ogp.me/ns#" lang="en">
<head>
<meta charset="utf-8">
<meta http-equiv="content-type" content="text/html; charset=utf-8">
<meta http-equiv="x-ua-compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>每周算法：生成有效的括号组合 | Hack Note</title>
<meta name="theme-color" content="#04519b">
<meta name="generator" content="Nikola (getnikola.com)">
<link rel="alternate" type="application/rss+xml" title="RSS" href="/rss.xml">
<link href="/assets/css/minima.min.css" rel="stylesheet" type="text/css">
<link rel="canonical" href="https://blog.wangzhl.com/posts/algorithm-weekly-generate-parentheses/">
<link rel="icon" href="/favicon.ico" sizes="64x64">
<link rel="prev" href="/posts/router-modem-and-switch/" title="路由、调制解调器和交换机" type="text/html">
<link rel="next" href="/posts/algorithm-weekly-swap-nodes-in-pairs/" title="每周算法：调换链表中节点" type="text/html">
<meta name="author" content="Samson Wang">
<meta property="og:site_name" content="Hack Note">
<meta property="og:title" content="每周算法：生成有效的括号组合">
<meta property="og:url" content="https://blog.wangzhl.com/posts/algorithm-weekly-generate-parentheses/">
<meta property="og:description" content="leetcode 算法题第22道，难度为medium，对指定数量的括号进行排列组合，列举出其中有效的结果。对括号的处理通常出现在表达式分析中，这道题目是了解括号表达式特性的很好切入点。





Description


Given n pairs of parentheses, write a function to generate all combinations of well-form">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2018-09-30T13:31:46+08:00">
<meta property="article:tag" content="algorithm">
<meta property="article:tag" content="bfs">
<meta property="article:tag" content="dp">
<meta property="article:tag" content="leetcode">
</head>
<body>
  <header class="site-header nav-custom"><div class="wrapper">
      <a class="site-title" rel="author" href="/">Hack Note</a>
      <nav class="site-nav"><input type="checkbox" id="nav-trigger" class="nav-trigger"><label for="nav-trigger">
          <span class="menu-icon">
            <svg viewbox="0 0 18 15" width="18px" height="15px"><use href="/assets/svg/theme.svg#menu-icon"></use></svg></span>
        </label>
        <div class="trigger">
          
            <a class="page-link" href="/">Home</a>
            <a class="page-link" href="/archive/">Archive</a>
            <a class="page-link" href="/tags/">Tags</a>
            <a class="page-link" href="/about/">About</a>

        </div>
      </nav>
</div>
  </header><main class="page-content" aria-label="Content"><div class="wrapper">

    

    
<article class="post h-entry" itemscope="" itemtype="http://schema.org/BlogPosting"><header class="post-header"><h1 class="post-title p-name" itemprop="name headline">每周算法：生成有效的括号组合</h1>

    <p class="post-meta">
      
    <time class="dt-published" datetime="2018-09-30T13:31:46+08:00" itemprop="datePublished">Sep 30, 2018</time></p>
  </header><div class="post-content e-content" itemprop="articleBody text">
    <p>
leetcode 算法题第22道，难度为medium，对指定数量的括号进行排列组合，列举出其中有效的结果。对括号的处理通常出现在表达式分析中，这道题目是了解括号表达式特性的很好切入点。<br></p>

<!-- TEASER_END -->

<div id="outline-container-org2d94a2c" class="outline-2">
<h2 id="org2d94a2c">Description</h2>
<div class="outline-text-2" id="text-org2d94a2c">
<p>
Given n pairs of parentheses, write a function to generate all combinations of well-formed parentheses.<br>
For example, given <i>n</i> = 3, a solution set is:<br></p>
<pre class="example">
[
  "((()))",
  "(()())",
  "(())()",
  "()(())",
  "()()()"
]
</pre>

<p>
来源：<a href="https://leetcode.com/problems/generate-parentheses/description/">leetcode 22 generate parentheses</a><br></p>
</div>
</div>
