posts/algorithm-weekly-generate-parentheses.org
*** Approach 1 DP
这是我想到的方法，按照DP解法的思想，将 =n= 分解为 （1 和 =n-1= ）、（2 和 =n-2= ）以及（ =i= 和 =n-i= ），再将分解后的两部分进行前后组合。这样，解决 =n= 的情况需要依赖于 =n-1= 的情况，依此递推，最终需要解决的问题得以简化为只有一个括号的情况。

下面是DP解法的实现：
#+BEGIN_SRC cpp
vector<string> generateParenthesis(int n) {
    vector<vector<string>> dp;
    dp.reserve(n+1);

    dp.push_back(vector<string>());
    dp.push_back(vector<string>({"()"}));

    for (int i=2; i<n+1; ++i) {
        set<string> s;
        for (int j=1; j<=i-j; ++j) {
            for (size_t m=0; m<dp[j].size(); ++m) {
                for (size_t n=0; n<dp[i-j].size(); ++n) {
                    s.insert(dp[j][m] + dp[i-j][n]);
                    s.insert(dp[i-j][n] + dp[j][m]);

                    if (j == 1) {
                        s.insert('(' + dp[i-j][n] + ')');
                    }
                }
            }
        }
        dp.push_back(vector<string>(s.begin(), s.end()));
    }
    return dp[n];
}
#+END_SRC

下面是DP解法的递归实现：
#+BEGIN_SRC cpp
vector<string> generateParenthesis(int n) {
    if (n == 1) {
        return vector<string>({"()"});
    }
    else if (n <= 0) {
        return vector<string>();
    }

    set<string> ans;
    for (int j=1; j<=n-j; ++j) {
        vector<string> pre1 = generateParenthesis(n-j);
        vector<string> pre2 = generateParenthesis(j);
        for (size_t i=0; i<pre1.size(); ++i) {
            for (size_t j=0; j<pre2.size(); ++j) {
                ans.insert(pre1[i] + pre2[j]);
                ans.insert(pre2[j] + pre1[i]);
            }
            if (j==1) {
                ans.insert('(' + pre1[i] + ')');
            }
        }
    }
    return vector<string>(ans.begin(), ans.end());
}
#+END_SRC

这种解法由于涉及到结果的二次组合，所以会出现重复的情况。为了过滤掉重复的组合，我使用 =std::set= 作为中间存储结构，这必定也使得解法的时间复杂度变高。

