posts/algorithm-weekly-generate-parentheses.org
*** Approach 2 Brute Force
大部分的算法题都能够使用暴力解法，这道题也不例外。下面的代码截取自leetcode的solution解析，使用java编写。

#+BEGIN_SRC java
class Solution {
    public List<String> generateParenthesis(int n) {
        List<String> combinations = new ArrayList();
        generateAll(new char[2 * n], 0, combinations);
        return combinations;
    }

    public void generateAll(char[] current, int pos, List<String> result) {
        if (pos == current.length) {
            if (valid(current))
                result.add(new String(current));
        } else {
            current[pos] = '(';
            generateAll(current, pos+1, result);
            current[pos] = ')';
            generateAll(current, pos+1, result);
        }
    }

    public boolean valid(char[] current) {
        int balance = 0;
        for (char c: current) {
            if (c == '(') balance++;
            else balance--;
            if (balance < 0) return false;
        }
        return (balance == 0);
    }
}
#+END_SRC

其中判断括号是否是有效的算法也是值得学习的。另外，对于生成所有的可能组合，这让我回想起之前的一道使用BFS题目，于是我使用C++实现了出来。

#+BEGIN_SRC cpp
void generateAllPossible(vector<string>& all, int n) {
    list<string> bfs;
    bfs.push_back("");
    while (bfs.size() != 0) {
        string frt = bfs.front();
        bfs.pop_front();
        if (frt.size() == n*2) {
            all.push_back(frt);
            continue;
        }
        bfs.push_back(frt + '(');
        bfs.push_back(frt + ')');
    }
}
#+END_SRC

该算法的时间复杂度为O(2^2n  * n)，字符串长度为2n，所以就有 2^2n 种可能，对每一种情况进行验证的时间复杂度为O(n)。空间复杂度为O(2^2n * n)。

*** Approach 3 Backtracking
针对上一种算法，如果将左右括号的数量记录下来，就能够在追加新的括号的时候加以判断，保证每个追加加的括号都是合理的。

#+BEGIN_SRC java
class Solution {
    public List<String> generateParenthesis(int n) {
        List<String> ans = new ArrayList();
        backtrack(ans, "", 0, 0, n);
        return ans;
    }

    public void backtrack(List<String> ans, String cur, int open, int close, int max){
        if (str.length() == max * 2) {
            ans.add(cur);
            return;
        }
        if (open < max)
            backtrack(ans, cur+"(", open+1, close, max);
        if (close < open)
            backtrack(ans, cur+")", open, close+1, max);
    }
}
#+END_SRC

时间复杂度和时间复杂度均为O(4^n / sqrt(n))，这个算法的时杂度分析与结果的数量有关，结果的数量是n阶Catalan numbers序列，具体可以参考 [[http://mathforum.org/advanced/robertd/catalan.html][这里]] 。

