posts/algorithm-weekly-generate-parentheses/index.html

<div id="outline-container-org366fbc6" class="outline-3">
<h3 id="org366fbc6">Approach 2 Brute Force</h3>
<div class="outline-text-3" id="text-org366fbc6">
<p>
大部分的算法题都能够使用暴力解法，这道题也不例外。下面的代码截取自leetcode的solution解析，使用java编写。<br></p>

<div class="highlight"><pre><span></span><span class="kd">class</span> <span class="nc">Solution</span> <span class="p">{</span>
    <span class="kd">public</span> <span class="n">List</span><span class="o">&lt;</span><span class="n">String</span><span class="o">&gt;</span> <span class="nf">generateParenthesis</span><span class="p">(</span><span class="kt">int</span> <span class="n">n</span><span class="p">)</span> <span class="p">{</span>
	<span class="n">List</span><span class="o">&lt;</span><span class="n">String</span><span class="o">&gt;</span> <span class="n">combinations</span> <span class="o">=</span> <span class="k">new</span> <span class="n">ArrayList</span><span class="p">();</span>
	<span class="n">generateAll</span><span class="p">(</span><span class="k">new</span> <span class="kt">char</span><span class="o">[</span><span class="mi">2</span> <span class="o">*</span> <span class="n">n</span><span class="o">]</span><span class="p">,</span> <span class="mi">0</span><span class="p">,</span> <span class="n">combinations</span><span class="p">);</span>
	<span class="k">return</span> <span class="n">combinations</span><span class="p">;</span>
    <span class="p">}</span>

    <span class="kd">public</span> <span class="kt">void</span> <span class="nf">generateAll</span><span class="p">(</span><span class="kt">char</span><span class="o">[]</span> <span class="n">current</span><span class="p">,</span> <span class="kt">int</span> <span class="n">pos</span><span class="p">,</span> <span class="n">List</span><span class="o">&lt;</span><span class="n">String</span><span class="o">&gt;</span> <span class="n">result</span><span class="p">)</span> <span class="p">{</span>
	<span class="k">if</span> <span class="p">(</span><span class="n">pos</span> <span class="o">==</span> <span class="n">current</span><span class="p">.</span><span class="na">length</span><span class="p">)</span> <span class="p">{</span>
	    <span class="k">if</span> <span class="p">(</span><span class="n">valid</span><span class="p">(</span><span class="n">current</span><span class="p">))</span>
		<span class="n">result</span><span class="p">.</span><span class="na">add</span><span class="p">(</span><span class="k">new</span> <span class="n">String</span><span class="p">(</span><span class="n">current</span><span class="p">));</span>
	<span class="p">}</span> <span class="k">else</span> <span class="p">{</span>
	    <span class="n">current</span><span class="o">[</span><span class="n">pos</span><span class="o">]</span> <span class="o">=</span> <span class="sc">'('</span><span class="p">;</span>
	    <span class="n">generateAll</span><span class="p">(</span><span class="n">current</span><span class="p">,</span> <span class="n">pos</span><span class="o">+</span><span class="mi">1</span><span class="p">,</span> <span class="n">result</span><span class="p">);</span>
	    <span class="n">current</span><span class="o">[</span><span class="n">pos</span><span class="o">]</span> <span class="o">=</span> <span class="sc">')'</span><span class="p">;</span>
	    <span class="n">generateAll</span><span class="p">(</span><span class="n">current</span><span class="p">,</span> <span class="n">pos</span><span class="o">+</span><span class="mi">1</span><span class="p">,</span> <span class="n">result</span><span class="p">);</span>
	<span class="p">}</span>
    <span class="p">}</span>

    <span class="kd">public</span> <span class="kt">boolean</span> <span class="nf">valid</span><span class="p">(</span><span class="kt">char</span><span class="o">[]</span> <span class="n">current</span><span class="p">)</span> <span class="p">{</span>
	<span class="kt">int</span> <span class="n">balance</span> <span class="o">=</span> <span class="mi">0</span><span class="p">;</span>
	<span class="k">for</span> <span class="p">(</span><span class="kt">char</span> <span class="n">c</span><span class="p">:</span> <span class="n">current</span><span class="p">)</span> <span class="p">{</span>
	    <span class="k">if</span> <span class="p">(</span><span class="n">c</span> <span class="o">==</span> <span class="sc">'('</span><span class="p">)</span> <span class="n">balance</span><span class="o">++</span><span class="p">;</span>
	    <span class="k">else</span> <span class="n">balance</span><span class="o">--</span><span class="p">;</span>
	    <span class="k">if</span> <span class="p">(</span><span class="n">balance</span> <span class="o">&lt;</span> <span class="mi">0</span><span class="p">)</span> <span class="k">return</span> <span class="kc">false</span><span class="p">;</span>
	<span class="p">}</span>
	<span class="k">return</span> <span class="p">(</span><span class="n">balance</span> <span class="o">==</span> <span class="mi">0</span><span class="p">);</span>
    <span class="p">}</span>
<span class="p">}</span>
</pre></div>

<p>
其中判断括号是否是有效的算法也是值得学习的。另外，对于生成所有的可能组合，这让我回想起之前的一道使用BFS题目，于是我使用C++实现了出来。<br></p>

<div class="highlight"><pre><span></span><span class="kt">void</span><span class="w"> </span><span class="nf">generateAllPossible</span><span class="p">(</span><span class="n">vector</span><span class="o">&lt;</span><span class="n">string</span><span class="o">&gt;&amp;</span><span class="w"> </span><span class="n">all</span><span class="p">,</span><span class="w"> </span><span class="kt">int</span><span class="w"> </span><span class="n">n</span><span class="p">)</span><span class="w"> </span><span class="p">{</span><span class="w"></span>
<span class="w">    </span><span class="n">list</span><span class="o">&lt;</span><span class="n">string</span><span class="o">&gt;</span><span class="w"> </span><span class="n">bfs</span><span class="p">;</span><span class="w"></span>
<span class="w">    </span><span class="n">bfs</span><span class="p">.</span><span class="n">push_back</span><span class="p">(</span><span class="s">""</span><span class="p">);</span><span class="w"></span>
<span class="w">    </span><span class="k">while</span><span class="w"> </span><span class="p">(</span><span class="n">bfs</span><span class="p">.</span><span class="n">size</span><span class="p">()</span><span class="w"> </span><span class="o">!=</span><span class="w"> </span><span class="mi">0</span><span class="p">)</span><span class="w"> </span><span class="p">{</span><span class="w"></span>
<span class="w">	</span><span class="n">string</span><span class="w"> </span><span class="n">frt</span><span class="w"> </span><span class="o">=</span><span class="w"> </span><span class="n">bfs</span><span class="p">.</span><span class="n">front</span><span class="p">();</span><span class="w"></span>
<span class="w">	</span><span class="n">bfs</span><span class="p">.</span><span class="n">pop_front</span><span class="p">();</span><span class="w"></span>
<span class="w">	</span><span class="k">if</span><span class="w"> </span><span class="p">(</span><span class="n">frt</span><span class="p">.</span><span class="n">size</span><span class="p">()</span><span class="w"> </span><span class="o">==</span><span class="w"> </span><span class="n">n</span><span class="o">*</span><span class="mi">2</span><span class="p">)</span><span class="w"> </span><span class="p">{</span><span class="w"></span>
<span class="w">	    </span><span class="n">all</span><span class="p">.</span><span class="n">push_back</span><span class="p">(</span><span class="n">frt</span><span class="p">);</span><span class="w"></span>
<span class="w">	    </span><span class="k">continue</span><span class="p">;</span><span class="w"></span>
<span class="w">	</span><span class="p">}</span><span class="w"></span>
<span class="w">	</span><span class="n">bfs</span><span class="p">.</span><span class="n">push_back</span><span class="p">(</span><span class="n">frt</span><span class="w"> </span><span class="o">+</span><span class="w"> </span><span class="sc">'('</span><span class="p">);</span><span class="w"></span>
<span class="w">	</span><span class="n">bfs</span><span class="p">.</span><span class="n">push_back</span><span class="p">(</span><span class="n">frt</span><span class="w"> </span><span class="o">+</span><span class="w"> </span><span class="sc">')'</span><span class="p">);</span><span class="w"></span>
<span class="w">    </span><span class="p">}</span><span class="w"></span>
<span class="p">}</span><span class="w"></span>
</pre></div>

<p>
该算法的时间复杂度为O(2<sup>2n</sup>  * n)，字符串长度为2n，所以就有 2<sup>2n</sup> 种可能，对每一种情况进行验证的时间复杂度为O(n)。空间复杂度为O(2<sup>2n</sup> * n)。<br></p>
</div>
</div>

<div id="outline-container-orga214113" class="outline-3">
<h3 id="orga214113">Approach 3 Backtracking</h3>
<div class="outline-text-3" id="text-orga214113">
<p>
针对上一种算法，如果将左右括号的数量记录下来，就能够在追加新的括号的时候加以判断，保证每个追加加的括号都是合理的。<br></p>

<div class="highlight"><pre><span></span><span class="kd">class</span> <span class="nc">Solution</span> <span class="p">{</span>
    <span class="kd">public</span> <span class="n">List</span><span class="o">&lt;</span><span class="n">String</span><span class="o">&gt;</span> <span class="nf">generateParenthesis</span><span class="p">(</span><span class="kt">int</span> <span class="n">n</span><span class="p">)</span> <span class="p">{</span>
	<span class="n">List</span><span class="o">&lt;</span><span class="n">String</span><span class="o">&gt;</span> <span class="n">ans</span> <span class="o">=</span> <span class="k">new</span> <span class="n">ArrayList</span><span class="p">();</span>
	<span class="n">backtrack</span><span class="p">(</span><span class="n">ans</span><span class="p">,</span> <span class="s">""</span><span class="p">,</span> <span class="mi">0</span><span class="p">,</span> <span class="mi">0</span><span class="p">,</span> <span class="n">n</span><span class="p">);</span>
	<span class="k">return</span> <span class="n">ans</span><span class="p">;</span>
    <span class="p">}</span>

    <span class="kd">public</span> <span class="kt">void</span> <span class="nf">backtrack</span><span class="p">(</span><span class="n">List</span><span class="o">&lt;</span><span class="n">String</span><span class="o">&gt;</span> <span class="n">ans</span><span class="p">,</span> <span class="n">String</span> <span class="n">cur</span><span class="p">,</span> <span class="kt">int</span> <span class="n">open</span><span class="p">,</span> <span class="kt">int</span> <span class="n">close</span><span class="p">,</span> <span class="kt">int</span> <span class="n">max</span><span class="p">){</span>
	<span class="k">if</span> <span class="p">(</span><span class="n">str</span><span class="p">.</span><span class="na">length</span><span class="p">()</span> <span class="o">==</span> <span class="n">max</span> <span class="o">*</span> <span class="mi">2</span><span class="p">)</span> <span class="p">{</span>
	    <span class="n">ans</span><span class="p">.</span><span class="na">add</span><span class="p">(</span><span class="n">cur</span><span class="p">);</span>
	    <span class="k">return</span><span class="p">;</span>
	<span class="p">}</span>
	<span class="k">if</span> <span class="p">(</span><span class="n">open</span> <span class="o">&lt;</span> <span class="n">max</span><span class="p">)</span>
	    <span class="n">backtrack</span><span class="p">(</span><span class="n">ans</span><span class="p">,</span> <span class="n">cur</span><span class="o">+</span><span class="s">"("</span><span class="p">,</span> <span class="n">open</span><span class="o">+</span><span class="mi">1</span><span class="p">,</span> <span class="n">close</span><span class="p">,</span> <span class="n">max</span><span class="p">);</span>
	<span class="k">if</span> <span class="p">(</span><span class="n">close</span> <span class="o">&lt;</span> <span class="n">open</span><span class="p">)</span>
	    <span class="n">backtrack</span><span class="p">(</span><span class="n">ans</span><span class="p">,</span> <span class="n">cur</span><span class="o">+</span><span class="s">")"</span><span class="p">,</span> <span class="n">open</span><span class="p">,</span> <span class="n">close</span><span class="o">+</span><span class="mi">1</span><span class="p">,</span> <span class="n">max</span><span class="p">);</span>
    <span class="p">}</span>
<span class="p">}</span>
</pre></div>

<p>
时间复杂度和时间复杂度均为O(4<sup>n</sup> / sqrt(n))，这个算法的时杂度分析与结果的数量有关，结果的数量是n阶Catalan numbers序列，具体可以参考 <a href="http://mathforum.org/advanced/robertd/catalan.html">这里</a> 。<br></p>
</div>
</div>
